Plantuml, language fixes
