--- a/src/osa3/03-abstrakti-luokka.md
+++ b/src/osa3/03-abstrakti-luokka.md
@@ -52,13 +52,25 @@ java: Muoto is abstract; cannot be instantiated
 
 Lähdemme tässä liikkeelle yksinkertaisesta esimerkistä, jossa laite voi vain vaihtaa tilaa, eikä esimerkiksi valita jotain erityistä tilaa. Palaamme monimutkaisempiin laitteiden säätömahdollisuuksiin myöhemmin. 
 
-```mermaid
-classDiagram
-    class Laite 
+```plantuml
+@startuml
+hide empty members
+skinparam class {
+    RoundCorner        0
+    BorderColor        #888888
+    BackgroundColor    transparent
+}
+skinparam arrowColor   #888888
 
-    Laite <|-- Valo
-    Laite <|-- Turvakamera
-    Laite <|-- Kahvinkeitin
+class Laite 
+class Valo
+class Turvakamera
+class Kahvinkeitin
+
+Laite <|-- Valo
+Laite <|-- Turvakamera
+Laite <|-- Kahvinkeitin
+@enduml
 ```
 
 ```java
